views/admin/editmerchantpopup.php

	   <div class="form-group row">
	   <label class="control-label col-md-4">Store Type</label>
	   <div class="col-md-8">
				      <?= $form->field($model, 'storetype')
				  ->dropdownlist(\yii\helpers\ArrayHelper::map(\app\models\Storetypes::find()
				  ->where(['type_status'=>'1'])
				  ->all(), 'ID', 'storetypename')
		,['prompt'=>'Select'])->label(false); ?>
---
SELECT * FROM `storetypes` WHERE `type_status`='1'