controllers/AdminController.php

SELECT * FROM `merchant`
---
	public function actionRating(){
		extract($_POST);
		$sdate = $sdate ?? date('Y-m-d');
		$edate = $edate ?? date('Y-m-d');

		$merchants = \app\models\Merchant::find()->asArray()->all();

SELECT * FROM `banners` ORDER BY `ID` DESC
---
	public function actionBannerdetails(){
		$status = '1';
		$bannerdet = Banners::find()

SELECT * FROM `rewards` ORDER BY `ID` DESC
---
	public function actionRewards(){
		$rewardsdet = Rewards::find()
		->orderBy([
            'ID'=>SORT_DESC
        ])
		->asArray()->all();

SELECT * FROM `merchant` ORDER BY `ID` DESC
---
	public function actionMerchants(){
		$model = new Merchant;
		$model->scenario = 'insertemail';
		if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post())) {
			Yii::$app->response->format = Response::FORMAT_JSON;
			return ActiveForm::validate($model);
		}
		if(!empty($_POST['storetype'])){
			$merchants = Merchant::find()
			->where(['storetype'=>$_POST['storetype']])
			->orderBy([
				'ID'=>SORT_DESC
			])
			->asArray()->all();
		}else{
			$merchants = Merchant::find()
			->orderBy([
				'ID'=>SORT_DESC
			])
			->asArray()->all();

SELECT * FROM `merchant` WHERE `ID`='47'
---
	public function actionEditmerchantpopup()
	{
		extract($_POST);
		$merchantModel = Merchant::findOne($id);

SELECT * FROM `merchant` WHERE `ID`='47'
---
	public function actionUpdatemerchant()
	{
		extract($_POST);
		$model = new Merchant;
		$model->scenario = 'updateemail';
		if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post())) {
			Yii::$app->response->format = Response::FORMAT_JSON;
			return ActiveForm::validate($model);
		}


		$merchantArr = Yii::$app->request->post('Merchant');
		$model->password = password_hash($merchantArr['password'], PASSWORD_DEFAULT);

		$merchantUpdate = Merchant::findOne($_POST['Merchant']['ID']);

UPDATE `merchant` SET `ID`=47, `latitude`='17.463430', `longitude`='78.366699', `scan_range`=200, `open_time`=9, `close_time`=22, `table_res_avail`=1, `owner_type`=1, `tax`=5, `tip`=5, `food_serve_type`=3, `allocated_msgs`=0, `used_msgs`=0, `table_occupy_status`=2, `popularity`=1, `approx_cost`=900, `cancel_decision`=3, `merchant_bill_copy`=1, `cancel_with_otp`=2 WHERE `ID`=47
---

		if($merchantUpdate->validate()){

			$merchantUpdate->save();