models/Merchant.php

	public function updatemerchantemail($attribute, $params)
    {
		$oldDet = Merchant::findOne($this->ID);
---
SELECT * FROM `merchant` WHERE `ID`='47'