models/Superadmin.php

	public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `superadmin` WHERE `ID`=1

    public static function findByUsername($username)
    {
                return static::findOne(['email' => $username]);
---
SELECT * FROM `superadmin` WHERE `email`='info@foodqonline.com'